Revit 2026 API

# ScheduleDefinitionIncludeLinkedFiles Property

---

Indicates if the schedule includes elements from linked files.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IncludeLinkedFiles { get; set; }
```
```vb
Public Property IncludeLinkedFiles As Boolean
	Get
	Set
```
```cpp
public:
property bool IncludeLinkedFiles {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IncludeLinkedFiles : bool with get, set
```

#### Property Value

Boolean True if elements in linked files should be included, false otherwise.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: This ScheduleDefinition does not support including elements from linked files. -or- When setting this property: This ScheduleDefinition is an embedded ScheduleDefinition. |

For an embedded ScheduleDefinition, this setting is controlled by the primary ScheduleDefinition and cannot be set in the embedded ScheduleDefinition.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace